frontend/controllers/RoutesController.php

UPDATE "routes" SET "name"='Маршрут 01', "end_stop_id"=4 WHERE "id"=1
---
    public function actionUpdate($route_id)
    {
        $model = $this->findModel($route_id);

        if ($this->request->isPost && $model->load($this->request->post()) && $model->save()) {

SELECT * FROM "routes" WHERE "id"='1'
---
    protected function findModel($route_id)
    {
        if (($model = Routes::findOne(['route_id' => $route_id])) !== null) {