frontend/controllers/ScheduleController.php

    protected function findModel($schedule_id)
    {
        if (($model = Schedule::findOne(['schedule_id' => $schedule_id])) !== null) {
---
SELECT * FROM "schedule" WHERE "schedule_id"='4'