frontend/controllers/SiteController.php

SELECT * FROM "bus_schedules"
---
    public function actionIndex()
    {
        $res = (new Query())->select('*')->from('bus_schedules')->all();