frontend/controllers/StopsController.php

SELECT * FROM "stops" WHERE "id"='1'
---
    protected function findModel($id)
    {
        if (($model = Stops::findOne(['id' => $id])) !== null) {